In [2]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

In [3]:
s1+5

일    15
이    20
삼    25
dtype: int64

In [4]:
s1

일    10
이    15
삼    20
dtype: int64

In [5]:
s1+s2

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [2]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])

In [7]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])

In [10]:
df2 = df1 + 3
df2

df2 * 2

       0  1  2
one    6  6  6
two    6  6  6
three  6  6  6

In [13]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])
df3

       0  1  2  3
one    1  1  1  1
two    1  1  1  1
three  1  1  1  1
four   1  1  1  1

In [12]:
df2 + df3

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

In [14]:
df2.add(df3)

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

문자열이 있는 데이타프레임의 연산

In [15]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }
df = DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [17]:
df * 2

     name  age  dept
0  홍길동홍길동   44  컴공컴공
1  박길동박길동   66  국어국어
2  김길동김길동   88  산업산업